# =================================================
# Fonts
# =================================================

cask "sf-symbols"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"

# =================================================
# GUI applications
# =================================================

# Tiling window manager for macOS
cask "aerospace"
# Database management tool
cask "dbeaver-community"
# Platform for containerized applications
cask "docker"
# Text expansion and automation tool
cask "espanso"
# Blue light reduction utility
cask "flux"
# API testing and development tool
cask "insomnia"
# Terminal emulator for macOS
cask "iterm2"
# Keyboard customization tool
cask "karabiner-elements"
# GUI for MongoDB database
cask "mongodb-compass"
# Secure password manager
cask "nordpass"
# VPN client
cask "nordvpn"
# Knowledge base and note-taking application
cask "obsidian"
# Spotlight replacement and productivity tool
cask "raycast"
# Music streaming service
cask "spotify"
# Cloud-based messaging application
cask "telegram"
# Alternative Discord client
cask "vesktop"
# Code editor by Microsoft
cask "visual-studio-code"
# High-performance code editor
cask "zed"
# Distraction-free web browser
cask "zen-browser"

# =================================================
# Programming languages
# =================================================

brew "elixir"
# Programming language for highly scalable real-time systems
brew "erlang"
# GNU compiler collection
brew "gcc"
# Statically typed language for Erlang VM
brew "gleam"
# Lightweight programming language
brew "lua"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup"
# Python version management
brew "pyenv"
# Python package installer written in Rust
brew "uv"
# functional metaprogramming aware language built on Erlang VM

# =================================================
# DBs
# =================================================

# Embeddable SQL OLAP database management system
brew "duckdb"

# =================================================
# Command-line tools
# =================================================

# Clone of `cat` with syntax highlighting and Git integration
brew "bat"
# Cross-platform system monitor
brew "bottom"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line tool to interact with exercism.io
brew "exercism"
# Modern replacement for `ls`
brew "eza"
# System information tool
brew "fastfetch"
# Simple, fast and user-friendly alternative to `find`
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Command-line shell for UNIX-like operating systems
brew "fish"
# Syntax-highlighting pager for `git` and `diff` output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# GitHub command-line tool
brew "gh"
# GNU PGP package
brew "gnupg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Post-modern modal text editor
brew "helix"
# Lightweight JSON processor
brew "jq"
# Terminal UI for Kubernetes
brew "k9s"
# Terminal UI for Docker
brew "lazydocker"
# Terminal UI for `git`
brew "lazygit"
# Pinentry for GPG on macOS
brew "pinentry-mac"
# Fast search tool similar to `grep`
brew "ripgrep"
# Command-line tool to customize Spotify
brew "spicetify-cli"
# Customizable cross-shell prompt
brew "starship"
# A cross-platform, fast and extensible general purpose fuzzy finder TUI
brew "television"
# Display directories as trees
brew "tree"
# Terminal recorder
brew "vhs"
# Internet file retriever
brew "wget"
# Fast terminal file manager
brew "yazi"
# Terminal workspace with multiplexer
brew "zellij"
# Plugin manager for `zsh`
brew "zplug"
# Smarter `cd` command
brew "zoxide"

# =================================================
# LSPs
# =================================================

# Language Server Protocol for Markdown
brew "marksman"
# TOML toolkit written in Rust
brew "taplo"
# Language Server for YAML files
brew "yaml-language-server"

# =================================================
# VSCode extensions
# =================================================

vscode "arr.marksman"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "dorzey.vscode-sqlfluff"
vscode "editorconfig.editorconfig"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "gleam.gleam"
vscode "kend.dancehelixkey"
vscode "matangover.mypy"
vscode "miguelsolorio.fluent-icons"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "naumovs.color-highlight"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "robertostermann.inline-parameters-extended"
vscode "rodolphebarbanneau.python-docstring-highlighter"
vscode "samuelcolvin.jinjahtml"
vscode "subframe7536.custom-ui-style"
vscode "tamasfe.even-better-toml"
vscode "yzhang.markdown-all-in-one"
