# == Taps ==
tap "catppuccin/tap"

# == Fonts ==
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "sf-symbols"

# == Applications ==
cask "codex"
cask "copilot-cli"
cask "claude-code"
cask "dbeaver-community"
cask "docker-desktop"
cask "flux-app"
cask "ghostty"
cask "insomnia"
cask "karabiner-elements"
cask "logi-options+"
cask "maccy"
cask "mongodb-compass"
cask "nordpass"
cask "nordvpn"
cask "obsidian"
cask "rectangle"
cask "spotify"
cask "telegram"
cask "vesktop"
cask "visual-studio-code"
cask "zed"
cask "zen"

# == Programming languages ==
brew "elixir"
brew "erlang"
brew "gcc"
brew "gleam"
brew "lua"
brew "rust"

# == Package managers ==
brew "poetry"
brew "rustup"
brew "uv"

# == Databases ==
brew "duckdb"

# == Command-line tools ==
brew "anomalyco/tap/opencode"
brew "bat"
brew "bottom"
brew "curl"
brew "docker-clean"
brew "dotdrop"
brew "exercism"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "graphviz"
brew "helix"
brew "hyperfine"
brew "jq"
brew "just"
brew "k9s"
brew "lazydocker"
brew "lazygit"
brew "mas"
brew "maturin"
brew "minikube"
brew "ollama"
brew "prettier"
brew "pnpm"
brew "pinentry-mac"
brew "pyenv"
brew "ripgrep"
brew "spicetify-cli"
brew "starship"
brew "vhs"
brew "wget"
brew "whalebrew"
brew "whiskers"
brew "zellij"
brew "zoxide"

# == Language server protocols ==
brew "elixir-ls"
brew "marksman"
brew "taplo"
brew "yaml-language-server"

# == Python packages ==
brew "pyupgrade"
brew "ruff"
brew "sqlfluff"
brew "ty"

# == VSCode extensions ==
vscode "astral-sh.ty"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "editorconfig.editorconfig"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "jock.svg"
vscode "kend.dancehelixkey"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode.vscode-typescript-next"
vscode "naumovs.color-highlight"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "robertostermann.inline-parameters-extended"
vscode "samuelcolvin.jinjahtml"
vscode "skellock.just"
vscode "subframe7536.custom-ui-style"
vscode "tamasfe.even-better-toml"
vscode "th3pool.all-files-formatter"
vscode "yzhang.markdown-all-in-one"
