# =================================================
# Taps
# =================================================

tap "homebrew/bundle"
tap "homebrew/services"

# =================================================
# Fonts
# =================================================

cask "font-jetbrains-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "sf-symbols"

# =================================================
# Apps
# =================================================

# Discord themes and plugins engine
cask "betterdiscord-installer"
# database management tool
cask "dbeaver-community"
# voice and text communication platform
cask "discord"
# containers management tool
cask "docker"
# text expander
cask "espanso"
# screen colour temperature controller
cask "flux"
# HTTP and GraphQL Client
cask "insomnia"
# JetBrains tools manager
cask "jetbrains-toolbox"
# hotkeys daemon
cask "karabiner-elements"
# i3-like tiling window manager
cask "nikitabobko/tap/aerospace"
# password manager
cask "nordpass"
# VPN client
cask "nordvpn"
# interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# notes and knowledge management tool
cask "obsidian"
# LLMs
cask "ollama"
# apps launcher
cask "raycast"
# music streaming service
cask "spotify"
# messaging app
cask "telegram"
# open-source code editor
# due to the issue with the latest version and APC extension, installation should be done via dmg file
# https://code.visualstudio.com/updates/v1_92
# cask "visual-studio-code"
# AI code editor
cask "zed"
# web browser for pure focus
cask "zen-browser"

# =================================================
# Programming Languages
# =================================================

brew "gcc"
brew "elixir"
brew "erlang"
brew "gleam"
brew "lua"
brew "node"
brew "pyenv"
brew "ruby"
brew "rust"
brew "rustup"

# =================================================
# Packages
# =================================================

# syntax highlighting with git integration
brew "bat"
# graphical process/system monitor
brew "bottom"
# image renderer for the terminal emulators
brew "catimg"
# defines a standard way of committing rules
brew "commitizen"
# query HTTP, HTTPS or FTP server
brew "curl"
# embeddable SQL OLAP Database Management System
brew "duckdb"
# command-line tool to interact with exercism.io
brew "exercism"
# modern replacement for ls
brew "eza"
# simple, fast and user-friendly alternative to find
brew "fd"
# a lightweight window border system for macOS
brew "FelixKratz/formulae/borders"
# a highly customizable macOS status bar replacement
brew "FelixKratz/formulae/sketchybar"
# command-line fuzzy finder written in go
brew "fzf"
# syntax-highlighting pager for git and diff output
brew "git-delta"
# GitHub command-line tool
brew "gh"
# GitLab command-line tool
brew "glab"
# GNU PGP package
brew "gnupg"
# graph visualization software from at&t and bell labs
brew "graphviz"
# post-modern modal text editor
brew "helix"
# command-line hex viewer
brew "hexyl"
# lightweight and flexible command-line json processor
brew "jq"
# cross-platform software keyboard remapper for Linux, macOS and Windows
brew "kanata"
# kubernetes cli to manage clusters in style
brew "k9s"
# lazier way to manage everything docker
brew "lazydocker"
# simple terminal ui for git commands
brew "lazygit"
# fast, highly customizable system info script
brew "neofetch"
# ambitious vim-fork focused on extensibility and agility
brew "neovim"
# pinentry for GPG on Mac
brew "pinentry-mac"
# search tool like grep and the silver searcher
brew "ripgrep"
# Spotify customization
brew "spicetify-cli"
# cross-shell prompt for astronauts
brew "starship"
# display directories as trees (with optional color/html output)
brew "tree"
# command-line unarchiving tools supporting multiple formats
brew "unar"
# your cli home video recorder
brew "vhs"
# internet file retriever
brew "wget"
# blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# pluggable terminal workspace with terminal multiplexer as the base feature
brew "zellij"
# next-generation plugin manager for zsh
brew "zplug"
# shell extension to navigate your filesystem faster
brew "zoxide"

# =================================================
# LSPs
# =================================================

# language server protocol for Markdown
brew "marksman"
# TOML toolkit written in Rust
brew "taplo"

# =================================================
# VSCode Extensions
# =================================================

vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "dorzey.vscode-sqlfluff"
vscode "drcika.apc-extension"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-material-theme-icons"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "gleam.gleam"
vscode "jock.svg"
vscode "kdl-org.kdl"
vscode "kend.dancehelixkey"
vscode "marclipovsky.string-manipulation"
vscode "matangover.mypy"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "robertostermann.inline-parameters-extended"
vscode "rodolphebarbanneau.python-docstring-highlighter"
vscode "samuelcolvin.jinjahtml"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "tgriesser.avro-schemas"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "yzhang.markdown-all-in-one"
