[
  "dataview",
  "obsidian-outliner",
  "tag-wrangler",
  "highlightr-plugin",
  "quick-latex",
  "obsidian-icon-folder",
  "obsidian-auto-link-title",
  "auto-card-link",
  "obsidian-tabs",
  "obsidian-style-settings",
  "obsidian-wakatime",
  "cm-editor-syntax-highlight-obsidian"
]