# =============================================================================================
# Taps
# =============================================================================================

tap "homebrew/bundle"
tap "homebrew/services"
tap "FelixKratz/formulae"

# =============================================================================================
# Fonts
# =============================================================================================

cask "font-jetbrains-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-iosevka-term-nerd-font"

# =============================================================================================
# Apps
# =============================================================================================

# installer for betterdiscord
cask "betterdiscord-installer"
# universal database tool and SQL client
cask "dbeaver-community"
# voice and text chat software
cask "discord"
# pack, ship and run any application as a lightweight container
cask "docker"
# cross-platform text expander written in Rust
cask "espanso"
# screen colour temperature controller
cask "flux"
# web browser
cask "google-chrome"
# HTTP and GraphQL Client
cask "insomnia"
# terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# jetbrains tools manager
cask "jetbrains-toolbox"
# keyboard customiser
cask "karabiner-elements"
# i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# password manager
cask "nordpass"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# control your tools with a few keystrokes
cask "raycast"
# app that enables mouse-free UI interaction
cask "shortcat"
# music streaming service
cask "spotify"
# tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# messaging app with a focus on speed and security
cask "telegram"
# open-source code editor
cask "visual-studio-code"
# AI code editor
cask "zed"

# =============================================================================================
# Programming languages, REPLs
# =============================================================================================

# programming language for highly scalable real-time systems
brew "erlang"
# functional metaprogramming aware language built on Erlang VM
brew "elixir"
# statically typed language for the Erlang VM
brew "gleam"
# powerful, lightweight programming language
brew "lua"
# platform built on V8 to build network applications
brew "node"
# powerful, clean, object-oriented scripting language
brew "ruby"
# safe, concurrent, practical language
brew "rust"

# manage multiple Node.js versions
brew "nvm"
# python version management
brew "pyenv"
# ruby version manager
brew "rbenv"
# install various Ruby versions and implementations
brew "ruby-build"
# rust toolchain installer
brew "rustup"

# =============================================================================================
# CLI tools
# =============================================================================================

# runs GitHub Actions locally
brew "act"
# cat with syntax highlighting and Git integration
brew "bat"
# a lightweight window border system for macOS
brew "borders"
# yet another cross-platform graphical process/system monitor
brew "bottom"
# defines a standard way of committing rules
brew "commitizen"
# query HTTP, HTTPS or FTP server
brew "curl"
# pack, ship and run any application as a lightweight container
brew "docker"
# CLI tool for running SQL queries against JSON, CSV, Excel, Parquet
brew "dsq"
# embeddable SQL OLAP Database Management System
brew "duckdb"
# modern replacement for 'ls'
brew "eza"
# simple, fast and user-friendly alternative to find
brew "fd"
# command-line fuzzy finder written in go
brew "fzf"
# gnu compiler collection
brew "gcc"
# syntax-highlighting pager for git and diff output
brew "git-delta"
# graph visualization software from at&t and bell labs
brew "graphviz"
# post-modern modal text editor
brew "helix"
# lightweight and flexible command-line json processor
brew "jq"
# kubernetes cli to manage your clusters in style!
brew "k9s"
# kubernetes command-line interface
brew "kubernetes-cli"
# lazier way to manage everything docker
brew "lazydocker"
# simple terminal ui for git commands
brew "lazygit"
# fast, highly customisable system info script
brew "neofetch"
# ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# pinentry for GPG on Mac
brew "pinentry-mac"
# search tool like grep and the silver searcher
brew "ripgrep"
# a highly customizable macOS status bar replacement
brew "sketchybar"
# Spotify customization
brew "spicetify-cli"
# cross-shell prompt for astronauts
brew "starship"
# display directories as trees (with optional color/html output)
brew "tree"
# command-line unarchiving tools supporting multiple formats
brew "unar"
# your cli home video recorder
brew "vhs"
# internet file retriever
brew "wget"
# blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# pluggable terminal workspace with terminal multiplexer as the base feature
brew "zellij"
# next-generation plugin manager for zsh
brew "zplug"
# shell extension to navigate your filesystem faster
brew "zoxide"

# =============================================================================================
# Linters, formatters and LSPs
# =============================================================================================

# static checker for GitHub Actions workflow files
brew "actionlint"
# a language server for Dockerfiles powered by Node.js
brew "dockerfile-language-server"
# Language Server and Debugger for Elixir
brew "elixir-ls"
# smarter Dockerfile linter to validate best practices
brew "hadolint"
# language server protocol for Markdown
brew "marksman"
# TOML toolkit written in Rust
brew "taplo"

# =============================================================================================
# VSCode extensions
# =============================================================================================

vscode "alefragnani.project-manager"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "dorzey.vscode-sqlfluff"
vscode "drcika.apc-extension"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-material-theme-icons"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "gleam.gleam"
vscode "griimick.vhs"
vscode "ibrahimfadel.yabai-syntax-highlighting"
vscode "jakebecker.elixir-ls"
vscode "james-yu.latex-workshop"
vscode "kdl-org.kdl"
vscode "marclipovsky.string-manipulation"
vscode "matangover.mypy"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "peterschmalfeldt.explorer-exclude"
vscode "ritwickdey.liveserver"
vscode "robertostermann.inline-parameters-extended"
vscode "rodolphebarbanneau.python-docstring-highlighter"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "silverquark.dancehelix"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "tgriesser.avro-schemas"
vscode "trond-snekvik.simple-rst"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudioexptteam.vscodeintellicode-completions"
vscode "vspacecode.whichkey"
vscode "wakatime.vscode-wakatime"
vscode "yzhang.markdown-all-in-one"
